{"found_keywords": {"StateGraph": "estration Ar chitecture The orchestration layer is implemented using LangGraph’sStateGraph. The interim ar- chitecture establishes a parallel fan-out structure ", "Dialectical Synthesis": " text and performs keyword-based scanning for ar- chitectural concepts such as “Dialectical Synthesis,” “Fan-In / Fan-Out,” and “Metacog- nition.” While this in", "Fan-In": "her’s outputs. This design decision p repares the architecture for true fan-out/fan-in swarm orchestration in later phases. Safe Tool Engineering Security and i", "Fan-Out": "one another’s outputs. This design decision p repares the architecture for true fan-out/fan-in swarm orchestration in later phases. Safe Tool Engineering Securi", "EvidenceAggregator": "e added in the final phase. 4 START RepoInvestigator DocAnalyst VisionInspector EvidenceAggregator (Fan-In) Prosecutor Defense Tech Lead ChiefJustice (Determini", "RepoInvestigator": "t structure at the Detective layer. From the START node, execution branches intoRepoInvestigatorandDocAnalystnodes concurrently. This parallel design avoids the", "DocAnalyst": "Detective layer. From the START node, execution branches intoRepoInvestigatorandDocAnalystnodes concurrently. This parallel design avoids the bottleneck and fra", "VisionInspector": "is layers will be added in the final phase. 4 START RepoInvestigator DocAnalyst VisionInspector EvidenceAggregator (Fan-In) Prosecutor Defense Tech Lead ChiefJu", "operator.add": "utputs at every stage of execution. Additionally, reducers are implemented usingoperator.addandoperator.iorwithin Annotated type hints. These reducers ensure th", "operator.ior": " stage of execution. Additionally, reducers are implemented usingoperator.addandoperator.iorwithin Annotated type hints. These reducers ensure that parallel age", "TypedDict": "s such asEvidenceand JudicialOpinion. The global graph state is defined using a TypedDict schema that explicitly declares all state fields. Plain Python diction", "BaseModel": "nagement is foundational to multi-agent orchestration. The system uses Pydantic BaseModel classes to define structured outputs such asEvidenceand JudicialOpinio", "Pydantic": " state management is foundational to multi-agent orchestration. The system uses Pydantic BaseModel classes to define structured outputs such asEvidenceand Judic", "git log": "nalysis The interim implementation extracts commit history using the command: 2 git log --oneline --reverse This allows the system to analyze development progre", "tempfile.TemporaryDirectory": "ons such as cloning external repositories. The repository cloning mechanism usestempfile.TemporaryDirectory() to sandbox all cloned content. Git operations are "}, "extracted_paths": [], "repo_files_exist": {"src/state.py": true, "src/tools/repo_tools.py": true, "src/tools/doc_tools.py": true, "src/nodes/detectives.py": true, "src/graph.py": true}, "chunks_count": 11}